[
  {
    "name": "Sakura",
    "post": "Japan is known for its rich cultural heritage and breathtaking cherry blossoms.",
    "comments": [
      {
        "user": "Hiroshi",
        "rate": 4,
        "comment": "I love the traditional architecture in Japan!"
      },
      {
        "user": "Yumi",
        "rate": 5,
        "comment": "The food in Japan is absolutely delicious."
      },
      {
        "user": "Takeshi",
        "rate": 3,
        "comment": "I wish to visit Japan someday."
      }
    ]
  },
  {
    "name": "Anahit",
    "post": "Armenia offers stunning landscapes and a fascinating history.",
    "comments": [
      {
        "user": "Narek",
        "rate": 4,
        "comment": "Armenian cuisine is so flavorful!"
      },
      {
        "user": "Lilit",
        "rate": 5,
        "comment": "The ancient monasteries in Armenia are awe-inspiring."
      },
      {
        "user": "Karen",
        "rate": 2,
        "comment": "I found the locals in Armenia to be very friendly."
      }
    ]
  },
  {
    "name": "Diego",
    "post": "Argentina is famous for its passionate tango dance and juicy steaks.",
    "comments": [
      {
        "user": "Valentina",
        "rate": 5,
        "comment": "I had the best steak of my life in Argentina!"
      },
      {
        "user": "Santiago",
        "rate": 3,
        "comment": "The vibrant street art in Buenos Aires is captivating."
      },
      {
        "user": "Camila",
        "rate": 4,
        "comment": "I enjoyed exploring the beautiful landscapes in Patagonia."
      }
    ]
  },
  {
    "name": "Giulia",
    "post": "Italy is renowned for its rich history, art, and mouthwatering cuisine.",
    "comments": [
      {
        "user": "Alessandro",
        "rate": 5,
        "comment": "I fell in love with the historic architecture in Italy!"
      },
      {
        "user": "Francesca",
        "rate": 4,
        "comment": "The gelato in Italy is simply divine."
      },
      {
        "user": "Marco",
        "rate": 3,
        "comment": "The coastal villages of Cinque Terre are breathtaking."
      }
    ]
  },
  {
    "name": "Carlos",
    "post": "Spain offers a vibrant culture, beautiful beaches, and delicious paella.",
    "comments": [
      {
        "user": "Maria",
        "rate": 4,
        "comment": "I can't get enough of the tapas in Spain!"
      },
      {
        "user": "Javier",
        "rate": 5,
        "comment": "The architecture of Antoni Gaudí in Barcelona is mind-blowing."
      },
      {
        "user": "Isabella",
        "rate": 3,
        "comment": "I enjoyed the flamenco dance performances in Seville."
      }
    ]
  },
  {
    "name": "Emma",
    "post": "The USA is a diverse country with iconic landmarks like the Statue of Liberty and the Grand Canyon.",
    "comments": [
      {
        "user": "Michael",
        "rate": 4,
        "comment": "New York City is a city that never sleeps!"
      },
      {
        "user": "Olivia",
        "rate": 5,
        "comment": "I was amazed by the natural wonders of Yellowstone National Park."
      },
      {
        "user": "Ethan",
        "rate": 2,
        "comment": "The portion sizes of food in the USA are huge!"
      }
    ]
  },
  {
    "name": "Liam",
    "post": "Australia is known for its stunning beaches, unique wildlife, and the Great Barrier Reef.",
    "comments": [
      {
        "user": "Sophia",
        "rate": 5,
        "comment": "I had a fantastic time snorkeling in the Great Barrier Reef."
      },
      {
        "user": "Charlotte",
        "rate": 3,
        "comment": "The kangaroos in Australia are adorable."
      },
      {
        "user": "Noah",
        "rate": 4,
        "comment": "Sydney Opera House is an architectural masterpiece."
      }
    ]
  },
  {
    "name": "Li",
    "post": "China has a rich cultural heritage, including the Great Wall and ancient temples.",
    "comments": [
      {
        "user": "Wang",
        "rate": 4,
        "comment": "The Chinese cuisine is incredibly diverse and delicious."
      },
      {
        "user": "Zhang",
        "rate": 5,
        "comment": "I was fascinated by the Terracotta Army in Xi'an."
      },
      {
        "user": "Chen",
        "rate": 2,
        "comment": "The crowds at popular tourist sites in China can be overwhelming."
      }
    ]
  },
  {
    "name": "Kai",
    "post": "Singapore is a modern city-state known for its cleanliness, futuristic architecture, and vibrant food scene.",
    "comments": [
      {
        "user": "Sara",
        "rate": 5,
        "comment": "I loved exploring the Gardens by the Bay in Singapore."
      },
      {
        "user": "Aiden",
        "rate": 3,
        "comment": "The hawker centers in Singapore have delicious street food."
      },
      {
        "user": "Zoe",
        "rate": 4,
        "comment": "Marina Bay Sands is an impressive architectural marvel."
      }
    ]
  },
  {
    "name": "Aarav",
    "post": "India is a land of rich traditions, diverse culture, and exquisite historical monuments.",
    "comments": [
      {
        "user": "Riya",
        "rate": 4,
        "comment": "The Taj Mahal in India is a true symbol of love."
      },
      {
        "user": "Arjun",
        "rate": 5,
        "comment": "I was mesmerized by the colors and festivities of Holi."
      },
      {
        "user": "Aditi",
        "rate": 3,
        "comment": "The street food in India is a culinary adventure."
      }
    ]
  }
]
